Repository: flammie/purplemonkeydishwasher
Catalog: 2016-iwclul/en-et (1).tmx
Source language: en
Languages: et

source: Unable to write to %s
et: Ei saa kirjutada %s -i

source: Cannot get debconf version. Is debconf installed?
et: Debconfi versiooni ei õnnestu tuvastada. Kas debconf on paigaldatud?

source: Package extension list is too long
et: Paketi laienduste loend on liiga pikk

source: Error processing directory %s
et: Viga kataloogi %s töötlemisel

source: Source extension list is too long
et: Allika laienduste loend on liiga pikk

source: Error writing header to contents file
et: Viga sisufailile päise kirjutamisel

source: Error processing contents %s
et: Viga %s sisu töötlemisel

source: Usage: apt-ftparchive [options] command Commands: packages binarypath [overridefile [pathprefix]] sources srcpath [overridefile [pathprefix]] contents path release path generate config [groups] clean config apt-ftparchive generates index files for Debian archives. It supports many styles of generation from fully automated to functional replacements for dpkg-scanpackages and dpkg-scansources apt-ftparchive generates Package files from a tree of .debs. The Package file contains the contents of all the control fields from each package as well as the MD5 hash and filesize. An override file is supported to force the value of Priority and Section. Similarly apt-ftparchive generates Sources files from a tree of .dscs. The --source-override option can be used to specify a src override file The 'packages' and 'sources' command should be run in the root of the tree. BinaryPath should point to the base of the recursive search and override file should contain the override flags. Pathprefix is appended to the filename fields if present. Example usage from the Debian archive: apt-ftparchive packages dists/potato/main/binary-i386/ > \\ dists/potato/main/binary-i386/Packages Options: -h This help text --md5 Control MD5 generation -s=? Source override file -q Quiet -d=? Select the optional caching database --no-delink Enable delinking debug mode --contents Control contents file generation -c=? Read this configuration file -o=? Set an arbitrary configuration option
et: Kasutamine: apt-ftparchive [võtmed] käsk Käsud: packages binarypath [overridefile [pathprefix]] sources srcpath [overridefile [pathprefix]] contents path release path generate config [groups] clean config apt-ftparchive genereerib Debiani arhiividele indeksifaile. See toetab mitmeid genereerimise stiile, alates täisautomaatsest kuni funktisionaalsete asendusteni ja dpkg-scanpackages ja dpkg-scansources jaoks apt-ftparchive genereerib .deb failide puust paketifaile. Paketifail sisaldab kõigi pakettide kontrollväljade sisu, MD5 räsi ja failisuurust. Toetatud on ka ülekirjutamise fail, et saaks Priority ja Section väärtuseid peale suruda. Sarnaselt genereerib apt-ftparchive .dscs failide puust lähtekoodi. src ülekirjutamise faili määramiseks saab kasutada võtit --source-override Käsud 'packages' ja 'sources' tuleks käivitada puu juurkaustas. BinaryPath peaks viitama tagurpidi otsingu põhjale ja ülekirjutusfail peaks sisaldama ülekirjutuslippe. Pathprefix lisatakse selle olemasolul failinime väljadele. Näidiskasutus Debiani arhiivist: apt-ftparchive packages dists/potato/main/binary-i386/ > \\ dists/potato/main/binary-i386/Packages Võtmed: -h See abitekst --md5 MD5 genereerimise juhtimine -s=? Lähtekoodi ülekirjutamise fail -q Vaikne -d=? Valikulise puhverandmebaasi valimine --no-delink Lahtiühendamise silumisržiimi lubamine --contents Sisufaili genereerimise juhtimine -c=? Selle seadistuste faili lugemine -o=? Suvalise seadistusvaliku määramine

source: No selections matched
et: Valikud ei kattunud

source: Some files are missing in the package file group `%s'
et: Paketi failigrupist `%s' on osa faile puudu

source: DB was corrupted, file renamed to %s.old
et: Andmebaas oli vigane, fail nimetati ümber %s.old

source: DB is old, attempting to upgrade %s
et: Andmebaas on vana, toimub katse %s -i uuendada

source: DB format is invalid. If you upgraded from an older version of apt, please remove and re-create the database.
et: Andmebaasi vorming on vigane. Kui sa uuendasid apt-i vanemast versioonist, siis palun eemalda ja loo andmebaas uuesti.

source: Unable to open DB file %s: %s
et: Andmebaasi faili %s: %s ei saa avada

source: Failed to stat %s
et: Faili %s teabe hankimine ebaõnnestus

source: Archive has no control record
et: Arhiivil pole juhtandmeid

source: Unable to get a cursor
et: Kursorit ei saa hõivata

source: W: Unable to read directory %s
et: W: Kataloogi %s lugemine ebaõnnestus

source: W: Unable to stat %s
et: W: Faili %s teabe hankimine ei ole võimalik

source: E: Errors apply to file
et: E: Vead kehtivad failile

source: Failed to resolve %s
et: %s ei lahendu

source: Failed to open %s
et: %s ei avane

source: Failed to unlink %s
et: %s lahtiühendamine nurjus

source: *** Failed to link %s to %s
et: *** %s-i %s-iga ühendamine nurjus

source: Archive had no package field
et: Arhiivil ei olnud paketivälja

source: %s has no override entry
et: %s-l pole tühistamise kirjet

source: %s maintainer is %s not %s
et: %s hooldaja on %s, mitte %s

source: %s has no source override entry
et: %s-l pole lähtekoodi ülekirjutamise kirjet

source: %s has no binary override entry either
et: %s-l pole ka binaarfaili ülekirjutamise kirjet

source: realloc - Failed to allocate memory
et: realloc - Mälu eraldamine nurjus

source: Unable to open %s
et: %s avamine pole võimalik

source: Failed to read the override file %s
et: Ülekirjutusfaili %s lugemine nurjus

source: Unknown compression algorithm '%s'
et: Tundmatu tihendusalgoritm '%s'

source: Compressed output %s needs a compression set
et: Pakitud väljund %s vajab määratud pakkimist

source: Failed to create IPC pipe to subprocess
et: Alamtöötluseks IPC toru loomine nurjus

source: Failed to create FILE*
et: Faili FILE* loomine nurjus

source: Failed to fork
et: Harunemine nurjus

source: Compress child
et: Lapsprotsessi kokkupakkimine

source: Internal error, failed to create %s
et: Sisemine viga, %s loomine nurjus

source: IO to subprocess/file failed
et: SV alamprotsessi/faili nurjus/

source: Failed to read while computing MD5
et: MD5 arvutamise ajal lugemine nurjus

source: Problem unlinking %s
et: Probleem %s-i lahtiühendamisega

source: Failed to rename %s to %s
et: %s ümbernimetamine %s-ks nurjus

source: Regex compilation error - %s
et: Regulaaravaldise kompileerimise viga - %s

source: but it is not installable
et: aga seda ei ole võimalik paigaldada

source: or
et: või

source: The following NEW packages will be installed:
et: Paigaldatakse järgnevad UUED paketid:

source: The following packages will be REMOVED:
et: EEMALDATAKSE järgnevad paketid:

source: The following packages have been kept back:
et: Järgnevaid pakette hoiti tagasi:

source: The following packages will be upgraded:
et: Uuendatakse järgnevaid pakette:

source: The following packages will be DOWNGRADED:
et: Järgnevatest pakettidest paigaldatakse VANEMAD VERSIOONID:

source: The following held packages will be changed:
et: Muudetakse järgnevaid ootel pakette

source: %s (due to %s)
et: %s (%s tõttu)

source: WARNING: The following essential packages will be removed. This should NOT be done unless you know exactly what you are doing!
et: HOIATUS: Järgnevad olulised paketid eemaldatakse. See EI OLE soovitatav juhul, kui sa ei tea täpselt, mida teed.

source: %lu upgraded, %lu newly installed,
et: %lu uuendatud, %lu värskelt paigaldatud,

source: %lu reinstalled,
et: %lu uuesti paigaldatud,

source: %lu downgraded,
et: %lu vanem versioon paigaldatud,

source: %lu to remove and %lu not upgraded.
et: %lu eemaldada ja %lu uuendamata.

source: %lu not fully installed or removed.
et: %lu pole täielikult paigaldatud või eemaldatud

source: Package %s is a virtual package provided by:
et: Pakett %s on virtuaalne pakett, mida pakub:

source: [Installed]
et: [Paigaldatud]

source: You should explicitly select one to install.
et: Sa peaksid paigalduseks ühe valima.

source: Package %s is not available, but is referred to by another package. This may mean that the package is missing, has been obsoleted, or is only available from another source
et: Pakett %s pole saadaval, aga teine pakett viitab sellele. See võib tähendada, et pakett puudub, on aegunud või on saadaval ainult teisest allikast.

source: However the following packages replace it:
et: Kuid järgnevad paketid asendavad selle:

source: Skipping %s, it is already installed and upgrade is not set.
et: %s jäetakse vahele, see on juba paigaldatud ja uuendamist pole määratud.

source: Reinstallation of %s is not possible, it cannot be downloaded.
et: Paketi %s uuesti paigaldamine pole võimalik, seda ei saa alla laadida.

source: %s is already the newest version.
et: %s on juba kõige uuem versioon.

source: %s set to manually installed.
et: %s on määratud käsitsi paigaldatuks.

source: Package %s is not installed, so not removed
et: Paketti %s ei eemaldatud, kuna seda ei ole paigaldatud

source: Correcting dependencies...
et: Sõltuvuste parandamine...

source: failed.
et: nurjus.

source: Unable to correct dependencies
et: Ei suuda sõltuvusi parandada

source: Unable to minimize the upgrade set
et: Värskenduste komplekti ei saa minimeerida

source: Unmet dependencies. Try using -f.
et: Lahendamata sõltuvused. Proovi võtmena kasutada -f.

source: WARNING: The following packages cannot be authenticated!
et: HOIATUS: Järgnevaid pakette ei õnnestunud autentida.

source: Authentication warning overridden.
et: Autentimise hoiatus tühstatud.

source: Install these packages without verification [y/N]?
et: Kas paigaldada need paketid ilma kontrollimata [y/N]?

source: Some packages could not be authenticated
et: Mõnda paketti ei saanud autentida

source: There are problems and -y was used without --force-yes
et: On probleeme ja -y kasutati ilma võtmeta --force-yes

source: Internal error, InstallPackages was called with broken packages!
et: Sisemine viga, InstallPackages kutsuti välja katkiste pakettidega!

source: Packages need to be removed but remove is disabled.
et: Paketid tuleb eemaldada, aga eemaldamine on keelatud.

source: Internal error, Ordering didn't finish
et: Sisemine viga, järjestamine ei saanud valmis

source: How odd.. The sizes didn't match, email apt@packages.debian.org
et: Imelik.. Suurused ei kattunud, saada e-kiri aadressile apt@packages.debian.org

source: Need to get %sB/%sB of archives.
et: On vaja tõmmata %sB/%sB arhiive.

source: After this operation, %sB disk space will be freed.
et: Pärast seda tegevust vabaneb %sB kettaruumi.

source: Couldn't determine free space in %s
et: Ei suutnud tuvastada vaba ruumi kettal %s

source: You don't have enough free space in %s.
et: Sul pole kettal %s piisavalt vaba ruumi.

source: Trivial Only specified but this is not a trivial operation.
et: Määratud on ainult triviaalne, aga see pole triviaalne tegevus.

source: Yes, do as I say!
et: Jah, tee nagu ma ütlen!

source: You are about to do something potentially harmful. To continue type in the phrase '%s' ?]
et: Sa kavatsed teha midagi potensiaalselt kahjulikku. Jätkamiseks trüki '%s' ?]

source: Abort.
et: Katkesta.

source: Failed to fetch %s %s
et: %s %s tõmbamine nurjus

source: Some files failed to download
et: Mõne faili allalaadimine nurjus

source: Download complete and in download only mode
et: Allalaadimine lõpetatud ja ainult allalaadimise režiimis

source: Unable to fetch some archives, maybe run apt-get update or try with --fix-missing?
et: Mõnda arhiivi ei saa tõmmata, ehk käivitad apt-get update või proovid --fix-missing?

source: --fix-missing and media swapping is not currently supported
et: --fix-missing ja andmekandja vahetamine pole praegu toetatud

source: Unable to correct missing packages.
et: Puuduvaid pakette ei saa parandada.

source: Aborting install.
et: Paigalduse katkestamine.

source: Ignore unavailable target release '%s' of package '%s'
et: Mittesaadaval sihtväljalaske '%s' paketist '%s' ignoreerimine

source: Picking '%s' as source package instead of '%s'
et: '%s' valimine lähtepaketiks '%s' asemel

source: The update command takes no arguments
et: Update käsk ei võta argumente

source: We are not supposed to delete stuff, can't start AutoRemover
et: Me ei tohi asju kustutada, ei saa AutoRemoverit käivitada

source: Hmm, seems like the AutoRemover destroyed something which really shouldn't happen. Please file a bug report against apt.
et: Hmm, paistab, et AutoRemover hävitas midagi, mida poleks tohtinud juhtuda. Palun saada apt-i kohta vearaport.Since you only requested a single operation it is extremely likely that the package is simply not installable and a bug report against that package should be filed.

source: The following information may help to resolve the situation:
et: Järgmine teave võib aidata olukorda lahendada:

source: Internal Error, AutoRemover broke stuff
et: Sisemine viga, AutoRemover lõhkus asju

source: Use 'apt-get autoremove' to remove them.
et: Kasuta nende eemaldamiseks 'apt-get autoremove'.

source: Internal error, AllUpgrade broke stuff
et: Sisemine viga, AllUpgrade lõhkus asju

source: Unmet dependencies. Try 'apt-get -f install' with no packages (or specify a solution).
et: Lahendamata sõltuvused. Proovi käsku 'apt-get -f install' ilma pakettideta (või määra lahendus).

source: Some packages could not be installed. This may mean that you have requested an impossible situation or if you are using the unstable distribution that some required packages have not yet been created or been moved out of Incoming.
et: Mõnda paketti ei saanud paigaldada. See võib tähendada, et oled palunud võimatut olukorda või kasutad ebastabiilset distributsiooni, millel on mõned vajalikud paketid veel loomata või on sissetulevate hulgast välja arvatud.

source: Broken packages
et: Katkised paketid

source: The following extra packages will be installed:
et: Paigaldatakse järgnevad lisapaketid:

source: Suggested packages:
et: Soovituslikud paketid:

source: Recommended packages:
et: Soovitatavad paketid:

source: Couldn't find package %s
et: Ei suutnud leida paketti %s

source: Calculating upgrade...
et: Uuenduse arvutamine...

source: Internal error, problem resolver broke stuff
et: Sisemine viga, probleemilahendaja lõhkus asju

source: Unable to lock the download directory
et: Ei saa lukustada allalaadimiskataloogi

source: Must specify at least one package to fetch source for
et: Pead määrama vähemalt ühe paketi, mille lähtekoodi tõmmata

source: Unable to find a source package for %s
et: Ei suutnud leida lähtepaketti %s jaoks

source: Skipping already downloaded file '%s'
et: Juba alla laaditud faili '%s' vahele jätmine

source: You don't have enough free space in %s
et: Sul pole kettal %s piisavalt vaba ruumi

source: Fetch source %s
et: Tõmba lähtekood %s

source: Failed to fetch some archives.
et: Mõne arhiivi tõmbamine nurjus.

source: Skipping unpack of already unpacked source in %s
et: %s-s juba lahti pakitud lähtekoodi lahtipakkimise vahele jätmine

source: Unpack command '%s' failed.
et: Lahtipakkimise käsk '%s' nurjus.

source: Check if the 'dpkg-dev' package is installed.
et: Kontrolli, kas pakett 'dpkg-dev' on paigaldatud.

source: Build command '%s' failed.
et: Lahtipakkimise käsk '%s' nurjus.

source: Child process failed
et: Lapsprotsess nurjus

source: Must specify at least one package to check builddeps for
et: Peab määrama vähemalt ühe paketi, mille ehitussõltuvusi kontrollida

source: Unable to get build-dependency information for %s
et: Paketi %s jaoks ei saa ehitussõltuvuste teavet hankida

source: %s has no build depends.
et: Paketil %s pole ehitussõltuvusi.

source: %s dependency for %s cannot be satisfied because the package %s cannot be found
et: %s sõltuvust %s jaoks ei saanud rahuldada, sest paketti %s ei suudetud leida

source: Failed to satisfy %s dependency for %s: Installed package %s is too new
et: Sõltuvuse %s rahuldamine %s jaoks nurjus: Paigaldatud pakett %s on liiga uus

source: Failed to satisfy %s dependency for %s: %s
et: Sõltuvuse %s rahuldamine %s jaoks nurjus: %s

source: Build-dependencies for %s could not be satisfied.
et: Ehitamise sõltuvusi %s jaoks ei saa rahuldada.

source: Failed to process build dependencies
et: Ehitamise sõltuvuste töötlemine nurjus

source: Supported modules:
et: Toetatud moodulid:

source: NOTE: This is only a simulation! apt-get needs root privileges for real execution. Keep also in mind that locking is deactivated, so don't depend on the relevance to the real current situation!
et: MÄRKUS: See on ainult simulatsioon! apt-get vajab tegelikuks käivitamise juurkasutaja õigusi. Samuti pea meeles, et lukustamine on välja lülitatud, nii et ära looda sobivusele tegeliku olukorraga!

source: Media change: please insert the disc labeled '%s' in the drive '%s' and press enter
et: Andmekandja vahetus: palun sisesta ketas nimega '%s' seadmesse '%s' ning vajuta enter

source: Unknown package record!
et: Tundmatu paketikirje!

source: Usage: apt-sortpkgs [options] file1 [file2 ...] apt-sortpkgs is a simple tool to sort package files. The -s option is used to indicate what kind of file it is. Options: -h This help text -s Use source file sorting -c=? Read this configuration file -o=? Set an arbitrary configuration option, eg -o dir::cache=/tmp
et: Kasutamine: apt-sortpkgs [võtmed] fail1 [fail2 ...] apt-sortpkgs on lihtne tööriist paketifailide sorteerimiseks. Valikut -s kasutatakse näitamaks, milline fail see on. Võtmed: -h See abitekst -s Allikfailide sorteerimise kasutamine -c=? Selle seadistuste faili lugemine -o=? Suvalise seadistusvaliku määramine, nt -o dir::cache=/tmp

source: Bad default setting!
et: Halb vaikesäte!

source: Press enter to continue.
et: Jätkamiseks vajuta enter.

source: Do you want to erase any previously downloaded .deb files?
et: Kas tahad kustutada kõik eelnevalt alla laetud .deb failid?

source: Some errors occurred while unpacking. Packages that were installed
et: Lahtipakkimisel tekkisid mõned tõrked. Paigaldatud paketid

source: will be configured. This may result in duplicate errors
et: seadistatakse. Selle tulemusel võib tekkida duplikaadivigu

source: or errors caused by missing dependencies. This is OK, only the errors
et: või puuduvate sõltuvuste põhjustatud vigu. See on normaalne, olulised on

source: above this message are important. Please fix them and run [I]nstall again
et: ainult need vead, mis asuvad ülalpool seda teadet. Palun paranda need ja käivita Pa[i]galdus uuesti.

source: Merging available information
et: Saadaoleva teabe liitmine

source: Open in a sandbox
et: Ava liivakastis

source: Open %s in a sandbox
et: Ava %s liivakastis

source: File not found: %s
et: Faili ei leitud: %s

source: Starting %s
et: %s käivitamine

source: Rights:
et: Õigused:

source: Everything
et: Kõik

source: Selected Link
et: Valitud viit

source: Specifies whether the AtkHyperlink object is selected
et: Määrab, milline AtkHyperlink on valitud

source: Number of Anchors
et: Ankrute arv

source: The number of anchors associated with the AtkHyperlink object
et: AtkHyperlink objektiga seotud ankrute arv

source: End index
et: Lõpuindeks

source: The end index of the AtkHyperlink object
et: AtkHyperlink objekti lõpuindeks

source: Start index
et: Algusindeks

source: The start index of the AtkHyperlink object
et: AtkHyperlink objekti algusindeks

source: invalid
et: vigane

source: accelerator label
et: kiirklahvi silt

source: alert
et: häire

source: animation
et: animatsioon

source: arrow
et: nool

source: calendar
et: kalender

source: canvas
et: lõuend

source: check box
et: märkeruut

source: check menu item
et: märgitav menüükirje

source: color chooser
et: värvivalija

source: column header
et: veeru päis

source: combo box
et: valikukast

source: dateeditor
et: kuupäevaredaktor

source: desktop icon
et: töölaua ikoon

source: desktop frame
et: töölaua raam

source: dial
et: häälestusnupp

source: dialog
et: dialoog

source: directory pane
et: kataloogipaan

source: drawing area
et: joonistamise ala

source: file chooser
et: failivalija

source: filler
et: täitja

source: fontchooser
et: kirjatüübivalija

source: frame
et: raam

source: glass pane
et: klaaspaan

source: html container
et: html konteiner

source: icon
et: ikoon

source: image
et: pilt

source: internal frame
et: sisemine raam

source: label
et: silt

source: layered pane
et: kihiline paan

source: list
et: nimekiri

source: list item
et: nimekirja element

source: menu
et: menüü

source: menu bar
et: menüüriba

source: menu item
et: menüüelement

source: option pane
et: valikupaan

source: page tab
et: leheküljesakk

source: page tab list
et: leheküljesakkide nimekiri

source: panel
et: paneel

source: password text
et: parooli tekst

source: popup menu
et: hüpikmenüü

source: progress bar
et: edenemisriba

source: push button
et: lülitamisnupp

source: radio button
et: raadionupp

source: radio menu item
et: raadionupuga menüükirje

source: root pane
et: põhipaan

source: row header
et: rea päis

source: scroll bar
et: kerimisriba

source: scroll pane
et: kerimispaan

source: separator
et: eraldaja

source: slider
et: liugur

source: split pane
et: poolitamispaan

source: spin button
et: kerimisnupp

source: statusbar
et: olekuriba

source: table
et: tabel

source: table cell
et: tabeli lahter

source: table column header
et: tabeli veerupäis

source: table row header
et: tabeli reapäis

source: tear off menu item
et: rebi-küljest menüüelement

source: text
et: tekst

source: toggle button
et: lülitinupp

source: tool bar
et: tööriistariba

source: tool tip
et: tööriistavihje

source: tree
et: puu

source: tree table
et: puutabel

source: unknown
et: tundmatu

source: viewport
et: vaatepunkt

source: window
et: aken

source: header
et: päis

source: footer
et: jalus

source: paragraph
et: lõik

source: ruler
et: joonlaud

source: application
et: rakendus

source: autocomplete
et: automaatlõpetus

source: edit bar
et: redigeerimisriba

source: embedded component
et: põimitud komponent

source: entry
et: sisestus

source: chart
et: tabel

source: caption
et: seletus

source: document frame
et: dokumendi raam

source: heading
et: päis

source: page
et: lehekülg

source: section
et: osa

source: redundant object
et: üleliigne objekt

source: form
et: vorm

source: link
et: viit

source: input method window
et: sisestusmeetodi aken

source: table row
et: tabeli rida

source: tree item
et: puu element

source: document spreadsheet
et: dokument, arvututabel

source: document presentation
et: dokument, esitlus

source: document text
et: dokument, tekst

source: document web
et: dokument, veebileht

source: document email
et: dokument, e-kiri

source: comment
et: kommentaar

source: list box
et: nimekirja kast

source: grouping
et: grupeerimine

source: image map
et: hüperpilt

source: notification
et: teade

source: info bar
et: inforiba

source: Accessible Name
et: Kasutatav nimi

source: Object instance's name formatted for assistive technology access
et: Objekti nimetus vormindatuna abistava tehnikaga kasutamiseks

source: Accessible Description
et: Kasutatav kirjeldus

source: Description of an object, formatted for assistive technology access
et: Objekti kirjeldus vormindatuna abistava tehnikaga kasutamiseks

source: Accessible Parent
et: Kasutatav vanem

source: Accessible Value
et: Kasutatav väärtus

source: Is used to notify that the value has changed
et: Kasutatakse väärtuse muutustest teavitamiseks

source: Accessible Role
et: Kasutatav roll

source: The accessible role of this object
et: Objekti kasutatav roll

source: Accessible Layer
et: Kasutatav kiht

source: The accessible layer of this object
et: Objekti kasutatav kiht

source: Accessible MDI Value
et: Kasutatav MDI väärtus

source: The accessible MDI value of this object
et: Objekti kasutatav MDI (mitme dokumendi liides) väärtus
